---
kind: property
id: P:Autodesk.Revit.DB.FabricationHostedInfo.HostId
source: html/d48cf763-b47f-1aea-2999-b86e03ff1caf.htm
---
# Autodesk.Revit.DB.FabricationHostedInfo.HostId Property

Returns the identifier of the host.

## Syntax (C#)
```csharp
public ElementId HostId { get; }
```